In [17]:
import pandas as pd
import sqlite3
import sqlalchemy

In [19]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)

In [13]:
dict = {'Names':['Esmi','Kwaku','Ana','Desmond','Darpoh','Joan','Nate'],
        'Marks':[76,87,56,67,78,99,90],
        'Gender':['Female','Male','Female','Male','Male','Female','Male']
}

df1 = pd.DataFrame(dict)
df1

     Names  Marks  Gender
0     Esmi     76  Female
1    Kwaku     87    Male
2      Ana     56  Female
3  Desmond     67    Male
4   Darpoh     78    Male
5     Joan     99  Female
6     Nate     90    Male

# Display top 3 rows

In [11]:
# This display first 5 rows
df1.head()

     Names  Marks  Gender
0     Esmi     76  Female
1    Kwaku     87    Male
2      Ana     56  Female
3  Desmond     67    Male
4   Darpoh     78    Male

In [33]:
# For first 3 rows
df1.head(3)

   Names  Marks  Gender
0   Esmi     76  Female
1  Kwaku     87    Male
2    Ana     56  Female

# Check last 3 rows

In [13]:
# This displays last 5 rows
df1.tail()

     Names  Marks  Gender
2      Ana     56  Female
3  Desmond     67    Male
4   Darpoh     78    Male
5     Joan     99  Female
6     Nate     90    Male

In [43]:
# For the last 3 rows
df1.head(3)

   Names  Marks  Gender
0   Esmi     76  Female
1  Kwaku     87    Male
2    Ana     56  Female

# Find the shape of dataset (Number of Rows and columns)

In [45]:
# Note- shape is not a method but an attribute
df1.shape

(7, 3)

In [47]:
print('Number of Rows',df1.shape[0])
print('Number of columns', df1.shape[1])

Number of Rows 7
Number of columns 3

# Get information About Our Dataset Like Total Number of Rows , Tptal Number of Columns, Datatypes of each column and memory requirements

In [50]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# Check Null Values in Datasets

In [53]:
df1.isnull()

   Names  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [55]:
# To check the summ of the null values
df1.isnull().sum()
# Means the are no null values

Names     0
Marks     0
Gender    0
dtype: int64

In [59]:
# if you pass an argument into the sum() like x- axis
df1.isnull().sum(axis=1)
#This will display null value count row-wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [63]:
# And this would display null value count column-wise
df1.isnull().sum(axis=0)

Names     0
Marks     0
Gender    0
dtype: int64

# Get Overall Statistics About DataFrame

In [66]:
#This will display coloumn-wise statistics but it did for only columns with numbers
df1.describe()

           Marks
count   7.000000
mean   79.000000
std    14.537308
min    56.000000
25%    71.500000
50%    78.000000
75%    88.500000
max    99.000000

In [68]:
# If we want it to display the statistics of all the other columns pass 'all'
df1.describe(include="all")

       Names      Marks Gender
count      7   7.000000      7
unique     7        NaN      2
top     Esmi        NaN   Male
freq       1        NaN      4
mean     NaN  79.000000    NaN
std      NaN  14.537308    NaN
min      NaN  56.000000    NaN
25%      NaN  71.500000    NaN
50%      NaN  78.000000    NaN
75%      NaN  88.500000    NaN
max      NaN  99.000000    NaN

# Find Unique Values From The Gender column

In [71]:
df1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

# Find the number of unique values from the gender column

In [76]:
# nunique was used
df1['Gender'].nunique()

2

# Display count of Unique values in Gender Coloumn

In [81]:
df1['Gender'].value_counts()

Gender
Male      4
Female    3
Name: count, dtype: int64

# Find total number of students with marks between 90 to 100 (inclusive) Using Between Method

In [88]:
# We can solve the above in many ways
# way 1
df1[df1['Marks']>=90]

  Names  Marks  Gender
5  Joan     99  Female
6  Nate     90    Male

In [94]:
#Way 2
# Note when writing two or more conditions dont forget your parenthesis
(df1['Marks']>=90) & (df1['Marks']<=100)

0    False
1    False
2    False
3    False
4    False
5     True
6     True
Name: Marks, dtype: bool

In [106]:
# For the count 
len([(df1['Marks']>=90) & (df1['Marks']<=100)])

1

In [102]:
#Using the between method note- the between method is always inclusive
sum(df1['Marks'].between(90,100))

2

# Average Marks

In [109]:
df1['Marks'].mean()

79.0

In [115]:
# For max and min marks
print(df1['Marks'].max())
print(df1['Marks'].min())

99
56

# Apply Method

In [118]:
# This is when we want to use our own custom method

In [120]:
def marks(x):
    return x/2

In [122]:
df1['Marks'].apply(marks)

0    38.0
1    43.5
2    28.0
3    33.5
4    39.0
5    49.5
6    45.0
Name: Marks, dtype: float64

# To create a new column

In [127]:
# A new column called Half_Marks

df1['Half_Marks'] = df1['Marks'].apply(marks)

In [129]:
df1

     Names  Marks  Gender  Half_Marks
0     Esmi     76  Female        38.0
1    Kwaku     87    Male        43.5
2      Ana     56  Female        28.0
3  Desmond     67    Male        33.5
4   Darpoh     78    Male        39.0
5     Joan     99  Female        49.5
6     Nate     90    Male        45.0

In [131]:
# Applying lambda function to marks column
# Note lambda function is a quick function you can quickly use. also known a anonymous funct
# So instead of defining a function you can quickly use a lambda function

df1['Marks'].apply(lambda x:x/2)

0    38.0
1    43.5
2    28.0
3    33.5
4    39.0
5    49.5
6    45.0
Name: Marks, dtype: float64

In [133]:
# another way to use the apply method 
# For instance to check length of Name column

df1['Names'].apply(len)

0    4
1    5
2    3
3    7
4    6
5    4
6    4
Name: Names, dtype: int64

# Map Function

In [138]:
# We want to convert male to 1 and Females to 0 using map function
df1['Gender'].map({'Male':1, 'Female':0})

0    0
1    1
2    0
3    1
4    1
5    0
6    1
Name: Gender, dtype: int64

# Let create a new coloum for the binary gender

In [140]:

df1['Gender_2'] = df1['Gender'].map({'Male':1, 'Female':0})

In [142]:
df1

     Names  Marks  Gender  Half_Marks  Gender_2
0     Esmi     76  Female        38.0         0
1    Kwaku     87    Male        43.5         1
2      Ana     56  Female        28.0         0
3  Desmond     67    Male        33.5         1
4   Darpoh     78    Male        39.0         1
5     Joan     99  Female        49.5         0
6     Nate     90    Male        45.0         1

# Drop column(s)

In [145]:
# Here we wish to delete or drop a coloumn  note- specify axis
df1.drop('Gender_2',axis=1)

     Names  Marks  Gender  Half_Marks
0     Esmi     76  Female        38.0
1    Kwaku     87    Male        43.5
2      Ana     56  Female        28.0
3  Desmond     67    Male        33.5
4   Darpoh     78    Male        39.0
5     Joan     99  Female        49.5
6     Nate     90    Male        45.0

# Dropping multiple columns

In [153]:

df1.drop(['Gender','Half_Marks'],axis=1)

     Names  Marks  Gender_2
0     Esmi     76         0
1    Kwaku     87         1
2      Ana     56         0
3  Desmond     67         1
4   Darpoh     78         1
5     Joan     99         0
6     Nate     90         1

# Name of colums

In [156]:
df1.columns

Index(['Names', 'Marks', 'Gender', 'Half_Marks', 'Gender_2'], dtype='object')

In [158]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# sort the DataFrame as per the marks column

In [161]:
df1.sort_values(by='Marks')

     Names  Marks  Gender  Half_Marks  Gender_2
2      Ana     56  Female        28.0         0
3  Desmond     67    Male        33.5         1
0     Esmi     76  Female        38.0         0
4   Darpoh     78    Male        39.0         1
1    Kwaku     87    Male        43.5         1
6     Nate     90    Male        45.0         1
5     Joan     99  Female        49.5         0

In [165]:
# in asc or desc
df1.sort_values(by='Marks',ascending = False )

     Names  Marks  Gender  Half_Marks  Gender_2
5     Joan     99  Female        49.5         0
6     Nate     90    Male        45.0         1
1    Kwaku     87    Male        43.5         1
4   Darpoh     78    Male        39.0         1
0     Esmi     76  Female        38.0         0
3  Desmond     67    Male        33.5         1
2      Ana     56  Female        28.0         0

In [167]:
# We can also use multiple columns for sorting

df1.sort_values(by=['Marks','Half_Marks'],ascending = False )

     Names  Marks  Gender  Half_Marks  Gender_2
5     Joan     99  Female        49.5         0
6     Nate     90    Male        45.0         1
1    Kwaku     87    Male        43.5         1
4   Darpoh     78    Male        39.0         1
0     Esmi     76  Female        38.0         0
3  Desmond     67    Male        33.5         1
2      Ana     56  Female        28.0         0

# Display Name and Marks of Female Students only

# Connecting to sql database

In [ ]:
engine = sqlach